In [2]:
import pandas as pd
data=[1,2,3,4,5]
seri=pd.Series(data)
print("series \n",seri)

series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
## create a series using dictionary
data={'a':1,'b':2,'c':30}
seri_dict=pd.Series(data)
print(seri_dict)

a     1
b     2
c    30
dtype: int64

In [3]:
data=[10,20,30]
idx=['a','b','c']
pd.Series(data,index=idx)

a    10
b    20
c    30
dtype: int64

In [15]:
## dataframe
# create a dataframe from a dictinary of list
data={
    'name':['alice','bob','jack'],
    'age':[25,30,45],
    'city':['banglore','new york','florida']

}
df=pd.DataFrame(data=data)
print(df)
print(type(df))

    name  age      city
0  alice   25  banglore
1    bob   30  new york
2   jack   45   florida
<class 'pandas.core.frame.DataFrame'>

In [9]:
## create a dictionary from a list of dictionaries
data=[
{'name':"jhon",'age':32,'city':'banglore'},
{'name':"alice",'age':42,'city':'florida'},
{'name':"Bob",'age':54,'city':'newYork'},
{'name':"marley",'age':36,'city':'dhule'}
]
df=pd.DataFrame(data=data)
print(df)
print(type(df))

     name  age      city
0    jhon   32  banglore
1   alice   42   florida
2     Bob   54   newYork
3  marley   36     dhule
<class 'pandas.core.frame.DataFrame'>

In [12]:
df=pd.read_csv('Iris.csv')
df.head(5)

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [13]:
df.tail(10)

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
140,141,6.7,3.1,5.6,2.4,Iris-virginica
141,142,6.9,3.1,5.1,2.3,Iris-virginica
142,143,5.8,2.7,5.1,1.9,Iris-virginica
143,144,6.8,3.2,5.9,2.3,Iris-virginica
144,145,6.7,3.3,5.7,2.5,Iris-virginica
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [16]:
## Accesing data from datframe
df

    name  age      city
0  alice   25  banglore
1    bob   30  new york
2   jack   45   florida

In [ ]:
df['name'] ## it becomes when we pick a one column

0    alice
1      bob
2     jack
Name: name, dtype: object

In [ ]:
df.loc[0] ## return a back the 0th whole row

name       alice
age           25
city    banglore
Name: 0, dtype: object

In [21]:
df.iloc[0][2]

C:\Users\harsh\AppData\Local\Temp\ipykernel_21480\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'banglore'

In [23]:
# accesing a specified element
df

    name  age      city
0  alice   25  banglore
1    bob   30  new york
2   jack   45   florida

In [27]:
df.at[1,'city']

'new york'

In [30]:
# Accessing a specifed element using iat
df.iat[2,2]

'florida'

In [41]:
## data manipulations with dataframe
df['salary']=[500,700,200]
df

    name  age      city  salary
0  alice   25  banglore     500
1    bob   30  new york     700
2   jack   45   florida     200

In [42]:
# REMOVE A COLUMN
df.drop('salary',axis=1,inplace=True)

In [43]:
df

    name  age      city
0  alice   25  banglore
1    bob   30  new york
2   jack   45   florida

In [44]:
# add age to the colum
df['age']=df['age']+1
df

    name  age      city
0  alice   26  banglore
1    bob   31  new york
2   jack   46   florida

In [45]:
df.drop(0,inplace=True)

In [46]:
df

   name  age      city
1   bob   31  new york
2  jack   46   florida

In [48]:
df=pd.read_csv("Iris.csv")
df.head(5)

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [51]:
print("data types:\n",df.dtypes)

print("statistical summary\n",df.describe())

# group by cols and perfrom an aggregation

data types:
 Id                 int64
SepalLengthCm    float64
SepalWidthCm     float64
PetalLengthCm    float64
PetalWidthCm     float64
Species           object
dtype: object
statistical summary
                Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000